name: "VGG_ILSVRC_16_layers"

input: "visual"
input_shape {
  dim: 1
  dim: 8192
}

layer {
  name: "visual_fc1"
  type: "InnerProduct"
  bottom: "visual"
  top: "visual_fc1"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 500
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}

layer {
  name: "relu1"
  type: "ReLU"
  bottom: "visual_fc1"
  top: "visual_fc1"
}

layer {
  name: "visual_fc2"
  type: "InnerProduct"
  bottom: "visual_fc1"
  top: "visual_fc2"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 300
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}

layer {
  name: "relu2"
  type: "ReLU"
  bottom: "visual_fc2"
  top: "visual_fc2"
}

layer {
  name: "relation"
  type: "InnerProduct"
  bottom: "visual_fc2"
  top: "relation"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 70
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}


layer {
  name: "relation_prob"
  type: "Softmax"
  bottom: "relation"
  top: "relation_prob"
}
