name: "RelationModel"

input: "visual_s"
input_shape {
  dim: 1
  dim: 4096
}
input: "visual_o"
input_shape {
  dim: 1
  dim: 4096
}

layer
{
  name: "visual_diff"
  type: "Eltwise"
  bottom: "visual_s"
  bottom: "visual_o"
  top: "visual_diff"
  eltwise_param {
    operation: SUM
    coeff: 1
    coeff: -1
  }
}

layer {
  name: "visual_fc1"
  type: "InnerProduct"
  bottom: "visual_diff"
  top: "visual_fc1"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 300 
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}

layer {
  name: "relu1"
  type: "ReLU"
  bottom: "visual_fc1"
  top: "visual_fc1"
}



layer {
  name: "relation"
  type: "InnerProduct"
  bottom: "visual_fc1"
  top: "relation"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 70
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relation_prob"
  type: "Softmax"
  bottom: "relation"
  top: "relation_prob"
}
